---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCConnectedWallData.Dispose
source: html/54b30a29-c119-6402-64be-3eb5ea949548.htm
---
# Autodesk.Revit.DB.IFC.IFCConnectedWallData.Dispose Method

Releases all resources used by the IFCConnectedWallData

## Syntax (C#)
```csharp
public void Dispose()
```